art_share/app/controllers/artworks_controller.rb

    def index
        artwork = Artwork.joins(:artworks_shares).where("artworks.artist_id = #{params[:user_id]} OR artwork_shares.viewer_id = #{params[:user_id]}")
---
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = 8 OR artwork_shares.viewer_id = 8)