art_share/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(shares_params)
        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 7], ["viewer_id", 8], ["created_at", "2021-04-01 20:40:58.807730"], ["updated_at", "2021-04-01 20:40:58.807730"]]