art_share/app/controllers/artworks_controller.rb

    def index
        artwork = Artwork.where(artist_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 8]]