art_share/app/controllers/artworks_controller.rb

    def index
        render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "snowy mountains"], ["image_url", "ww.mountains.com"], ["artist_id", 6], ["created_at", "2021-04-01 18:57:03.060883"], ["updated_at", "2021-04-01 18:57:03.060883"]]

    def destroy
         artwork = Artwork.find(params[:id])

        unless artwork.nil?
            artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 12]]

    def update
        artwork = Artwork.find(params[:id])

        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.mountains.com"], ["updated_at", "2021-04-01 19:00:11.504148"], ["id", 12]]