art_share/app/controllers/users_controller.rb

    def index
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "andrew"], ["created_at", "2021-04-01 17:49:11.456783"], ["updated_at", "2021-04-01 17:49:11.456783"]]